UFTOneAutomationTests/APITestCreateOrder/Log/vtd_user.log

2022-02-24 17:49:11,094 [1] INFO  - Loaded appender: FileAppenderExternal
2022-02-24 17:49:11,114 [1] INFO  - Loaded appender: UserLoggerAppender
2022-02-24 17:49:11,114 [1] INFO  - Loaded appender: FileAppenderInternal
2022-02-24 17:49:11,114 [1] INFO  - Loaded appender: FileAppenderExternal
2022-02-24 17:49:11,114 [1] INFO  - Loaded appender: UserLoggerAppender
2022-02-24 17:49:11,114 [1] INFO  - Loaded appender: FileAppenderInternal
2022-02-24 17:49:11,711 [18] INFO  - Step 'Start' : Step 'Start' started
2022-02-24 17:49:11,745 [18] INFO  - Step 'Start' ended successfully
2022-02-24 17:49:11,746 [18] INFO  - Step 'Test Flow' : Step 'Test Flow' started
2022-02-24 17:49:11,977 [18] INFO  - Step 'Iteration 1' : Step 'Iteration 1' started
2022-02-24 17:49:11,977 [18] INFO  - Step 'GetFlights' : Step 'GetFlights' started
2022-02-24 17:49:11,997 [18] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <GetFlights xmlns="HP.SOAQ.SampleApp">
      <DepartureCity>San Francisco</DepartureCity>
      <ArrivalCity>Los Angeles</ArrivalCity>
      <FlightDate>2115-02-28T00:00:00</FlightDate>
    </GetFlights>
  </Body>
</Envelope>

2022-02-24 17:49:12,008 [18] INFO  - URL: http://localhost:8000/Flights_SOAP
2022-02-24 17:49:12,048 [18] INFO  - Returning the response to the previous channel
2022-02-24 17:49:12,048 [18] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <GetFlightsResponse xmlns="HP.SOAQ.SampleApp">
      <GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <Flight>
          <Airline>DA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>08:53 AM</ArrivalTime>
          <DepartureCity>San Francisco</DepartureCity>
          <DepartureTime>08:09 AM</DepartureTime>
          <FlightNumber>1435</FlightNumber>
          <Price>109.2</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>08:45 AM</ArrivalTime>
          <DepartureCity>San Francisco</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>3227</FlightNumber>
          <Price>103.9</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>11:09 AM</ArrivalTime>
          <DepartureCity>San Francisco</DepartureCity>
          <DepartureTime>10:24 AM</DepartureTime>
          <FlightNumber>3231</FlightNumber>
          <Price>105.2</Price>
        </Flight>
        <Flight>
          <Airline>UA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>02:48 PM</ArrivalTime>
          <DepartureCity>San Francisco</DepartureCity>
          <DepartureTime>12:48 PM</DepartureTime>
          <FlightNumber>3233</FlightNumber>
          <Price>166.2</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>01:33 PM</ArrivalTime>
          <DepartureCity>San Francisco</DepartureCity>
          <DepartureTime>12:48 PM</DepartureTime>
          <FlightNumber>3235</FlightNumber>
          <Price>108.8</Price>
        </Flight>
        <Flight>
          <Airline>UA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>04:18 PM</ArrivalTime>
          <DepartureCity>San Francisco</DepartureCity>
          <DepartureTime>12:48 PM</DepartureTime>
          <FlightNumber>3236</FlightNumber>
          <Price>174.47</Price>
        </Flight>
        <Flight>
          <Airline>DL</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>04:42 PM</ArrivalTime>
          <DepartureCity>San Francisco</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>3238</FlightNumber>
          <Price>175.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>03:57 PM</ArrivalTime>
          <DepartureCity>San Francisco</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>3239</FlightNumber>
          <Price>103.4</Price>
        </Flight>
        <Flight>
          <Airline>DA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>01:41 PM</ArrivalTime>
          <DepartureCity>San Francisco</DepartureCity>
          <DepartureTime>12:57 PM</DepartureTime>
          <FlightNumber>3418</FlightNumber>
          <Price>170.47</Price>
        </Flight>
        <Flight>
          <Airline>DA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>10:05 AM</ArrivalTime>
          <DepartureCity>San Francisco</DepartureCity>
          <DepartureTime>09:21 AM</DepartureTime>
          <FlightNumber>3564</FlightNumber>
          <Price>124.4</Price>
        </Flight>
        <Flight>
          <Airline>DA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>05:17 PM</ArrivalTime>
          <DepartureCity>San Francisco</DepartureCity>
          <DepartureTime>04:33 PM</DepartureTime>
          <FlightNumber>4941</FlightNumber>
          <Price>177.47</Price>
        </Flight>
        <Flight>
          <Airline>DA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>07:41 PM</ArrivalTime>
          <DepartureCity>San Francisco</DepartureCity>
          <DepartureTime>06:57 PM</DepartureTime>
          <FlightNumber>6065</FlightNumber>
          <Price>122.8</Price>
        </Flight>
        <Flight>
          <Airline>DA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>12:29 PM</ArrivalTime>
          <DepartureCity>San Francisco</DepartureCity>
          <DepartureTime>11:45 AM</DepartureTime>
          <FlightNumber>6087</FlightNumber>
          <Price>111.2</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>11:00 AM</ArrivalTime>
          <DepartureCity>San Francisco</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>6226</FlightNumber>
          <Price>173.47</Price>
        </Flight>
        <Flight>
          <Airline>DA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>04:05 PM</ArrivalTime>
          <DepartureCity>San Francisco</DepartureCity>
          <DepartureTime>03:21 PM</DepartureTime>
          <FlightNumber>7465</FlightNumber>
          <Price>122.8</Price>
        </Flight>
        <Flight>
          <Airline>DA</Airline>
          <ArrivalCity>Los Angeles</ArrivalCity>
          <ArrivalTime>02:53 PM</ArrivalTime>
          <DepartureCity>San Francisco</DepartureCity>
          <DepartureTime>02:09 PM</DepartureTime>
          <FlightNumber>7854</FlightNumber>
          <Price>125.2</Price>
        </Flight>
      </GetFlightsResult>
    </GetFlightsResponse>
  </s:Body>
</s:Envelope>

2022-02-24 17:49:12,068 [18] INFO  - Structural Validation: True
2022-02-24 17:49:12,076 [18] INFO  - Step 'GetFlights' ended successfully
2022-02-24 17:49:12,078 [18] INFO  - Step 'CreateFlightOrder' : Step 'CreateFlightOrder' started
2022-02-24 17:49:12,086 [18] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
  <Body>
    <CreateFlightOrder xmlns="HP.SOAQ.SampleApp">
      <FlightOrder>
        <Class>Business</Class>
        <CustomerName>John Parker</CustomerName>
        <DepartureDate>2115-02-28T00:00:00</DepartureDate>
        <FlightNumber>1435</FlightNumber>
        <NumberOfTickets>1</NumberOfTickets>
      </FlightOrder>
    </CreateFlightOrder>
  </Body>
</Envelope>

2022-02-24 17:49:12,088 [18] INFO  - URL: http://localhost:8000/Flights_SOAP
2022-02-24 17:49:12,096 [18] INFO  - Returning the response to the previous channel
2022-02-24 17:49:12,098 [18] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <CreateFlightOrderResponse xmlns="HP.SOAQ.SampleApp">
      <CreateFlightOrderResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <OrderNumber>4065</OrderNumber>
        <TotalPrice>218.4</TotalPrice>
      </CreateFlightOrderResult>
    </CreateFlightOrderResponse>
  </s:Body>
</s:Envelope>

2022-02-24 17:49:12,098 [18] INFO  - Structural Validation: True
2022-02-24 17:49:12,098 [18] INFO  - Step 'CreateFlightOrder' ended successfully
2022-02-24 17:49:12,098 [18] INFO  - Step 'Iteration 1' ended successfully
2022-02-24 17:49:12,107 [18] INFO  - Step 'Test Flow' ended successfully
2022-02-24 17:49:12,271 [18] INFO  - Step 'End' : Step 'End' started
2022-02-24 17:49:12,279 [18] INFO  - Step 'End' ended successfully
